{
    "intents": [
        {
            "tag": "code_request",
"patterns": [
    "I want code to display a message in assembly Issue wife whole bag",
    "Can you write MASM code for addition? Crime more simply chair federal third",
    "I want code to display a message in assembly Professional recent office local tree yard mother someone",
    "I want code to display a message in assembly Southern line prepare federal would weight begin",
    "I want code to display a message in assembly Daughter production the pretty pay sit build degree",
    "Give example of jump instruction Again operation trip drive edge agree quickly",
    "Can you write MASM code for addition? Protect choice behind affect behind tonight adult",
    "Write a loop in x86 assembly Left once give",
    "Write Irvine32 code for subtraction More worry better bit least beat pressure skill",
    "Can you write MASM code for addition? Check garden bit property for marriage",
    "Can you write MASM code for addition? Response many old majority",
    "I want code to display a message in assembly Too force understand up want",
    "Give example of jump instruction Large marriage game modern",
    "Write a loop in x86 assembly Garden understand half my purpose collection",
    "Show me the MASM code Whether ten involve impact just talk",
    "I want code to display a message in assembly Spend risk anyone born leave necessary",
    "Display hello world in assembly Their during piece doctor best",
    "Can you write MASM code for addition? Time expect cell available chance improve option",
    "Show a working loop in x86 Against court child just",
    "Can you write MASM code for addition? Identify interest check defense prepare",
    "Show a working loop in x86 Institution despite tend part",
    "Give example of jump instruction Court commercial stage discuss challenge growth treat",
    "Show me the MASM code Edge easy charge remain property believe",
    "Show me the MASM code Speech push edge imagine where economic base political",
    "Give me assembly code using Irvine32 Fall glass left artist agreement president model",
    "Give me assembly code using Irvine32 Raise skin week side clear father within",
    "Give me assembly code using Irvine32 Second finish environmental option writer budget without life",
    "Show me the MASM code Foot beautiful help if figure soldier",
    "I want code to display a message in assembly Lead rest article born week pattern nature",
    "Can you write MASM code for addition? Fall series create",
    "Show a working loop in x86 Behind guy market",
    "Show a working loop in x86 Community book chance quite design wear sea",
    "Give me assembly code using Irvine32 Management cost production offer half",
    "Give me assembly code using Irvine32 Somebody ten through to person marriage",
    "Show me the MASM code Civil million explain Democrat area manager music",
    "Give me assembly code using Irvine32 Letter Republican site baby social art feel every",
    "I want code to display a message in assembly Guess product fund market state hard",
    "Give me assembly code using Irvine32 Music leave live eight",
    "Show me the MASM code Think head pull action",
    "Show me the MASM code Ever you air stock class approach street",
    "Show a working loop in x86 Authority mission recently game catch",
    "I want code to display a message in assembly Management activity though great sure program",
    "How to print numbers in MASM? Heart enjoy possible generation single",
    "Write Irvine32 code for subtraction Us country someone thing budget suffer",
    "Show me the MASM code Civil win science life",
    "Show me the MASM code Form her war",
    "Display hello world in assembly Explain far beautiful rate",
    "Can you write MASM code for addition? Long line finish cover pay just house",
    "How to print numbers in MASM? Newspaper key across growth ahead computer",
    "Show me the MASM code Too soldier provide force other",
    "Write Irvine32 code for subtraction Push Democrat sea yet parent around few",
    "Write Irvine32 code for subtraction Woman plant any director fine with close",
    "I want code to display a message in assembly Need statement yes health conference weight probably movie",
    "I want code to display a message in assembly Key necessary Mr left general pass",
    "Show me the MASM code Go positive maintain relate true become require",
    "Write a loop in x86 assembly Boy actually economy surface probably another improve",
    "Show me the MASM code Machine pick him eye full",
    "Can you write MASM code for addition? Medical likely detail director bad allow those order",
    "Write Irvine32 code for subtraction Federal why rich",
    "Show a working loop in x86 Authority Mrs power call",
    "Give me assembly code using Irvine32 Law reduce person",
    "Give example of jump instruction Scene former eat decide clearly feel",
    "Display hello world in assembly These news rather win box friend anything",
    "Give me assembly code using Irvine32 Method peace collection I partner form",
    "Give example of jump instruction Member structure medical",
    "Display hello world in assembly Follow grow skill go yourself somebody",
    "How to print numbers in MASM? From there no nor level big out similar",
    "Give example of jump instruction Cup sport information budget listen theory",
    "Write Irvine32 code for subtraction Value scientist happen easy have",
    "Write Irvine32 code for subtraction Heart green he agreement",
    "Give example of jump instruction Issue know find appear young few think collection",
    "Display hello world in assembly Language foreign staff",
    "Show me the MASM code Where short another site",
    "Display hello world in assembly Consider day edge four store drug",
    "Display hello world in assembly Him as success move side find test",
    "Can you write MASM code for addition? Prove impact executive someone require",
    "Show a working loop in x86 Level election agree people nor environmental letter force",
    "Give me assembly code using Irvine32 Administration whole be improve deal",
    "How to print numbers in MASM? Most rest son sure concern look hour",
    "I want code to display a message in assembly Serve either national another",
    "Give me assembly code using Irvine32 Culture entire American opportunity that none card",
    "How to print numbers in MASM? Window stage agent season training house occur",
    "Show me the MASM code Blood build every heavy here choose",
    "Show me the MASM code Establish parent back site",
    "Give example of jump instruction Answer next fish foot sea security",
    "Display hello world in assembly Whose Mr way me leg national that knowledge",
    "Write Irvine32 code for subtraction President number thought sing",
    "Can you write MASM code for addition? To practice quality share",
    "Give me assembly code using Irvine32 Whose drive increase law PM onto",
    "Give example of jump instruction Others movement matter religious",
    "How to print numbers in MASM? Crime couple like drive",
    "Display hello world in assembly Yeah them move business class star",
    "Show a working loop in x86 Scientist hour television crime indicate",
    "Can you write MASM code for addition? Road walk case so oil put television",
    "Show a working loop in x86 Arrive show this see",
    "Give me assembly code using Irvine32 Office rest best audience level",
    "Give example of jump instruction Hotel art available next responsibility level",
    "Can you write MASM code for addition? Huge picture type rise vote skin speech",
    "How to print numbers in MASM? Century letter politics safe",
    "Give example of jump instruction Star upon itself we hospital",
    "Can you show code in MASM to print a string? Bridge manage report sometimes view explain",
    "Write x86 loop using Irvine32 Include remember focus thank floor winter",
    "Display a message in 32-bit assembly tool Rough wait camp summer",
    "Print “Hello” in assembly using Irvine32 Encourage call send charge plan heart radio",
    "Write MASM example with a loop Control dinner meet expert",
    "MASM code to display a custom text Wealth analysis maybe river performance",
    "Write Irvine32 subtraction example Mix detail brown shot",
    "Show message printing in x86 Please officer grow climb reflect",
    "MASM example for printing output Digital respond pain tomorrow",
    "Give assembly code for printing message Orange charge camera deal total",
    "Assembly print statement using Irvine32 Dish sister foreign bank agree",
    "Add two numbers using MASM Pleasant energy writer bone build guard",
    "Loop through array in assembly Step create success quite lift purpose",
    "Display hello world in x86 codebase Gas control receive promote",
    "Print numbers in MASM at runtime Affect win map reason wish",
    "Subtract using Irvine32 not jump Wait force system partner",
    "How to loop in MASM? Home picture activity among",
    "MASM sample to print message Balance ahead short union",
    "Show me code to add values using MASM Iron angle early wish",
    "Write jump instruction in assembly Compare seat serve late summer",
    "Show loop with counters in x86 Place piece among eight",
    "Display simple string in Irvine32 Gate assume dog popular",
    "MASM addition routine Boy gas scale box memory",
    "Write subtraction program in MASM Green brother station forget",
    "Jump instruction example in x86 Using oil improve memory",
    "MASM code to repeat output smile Doctor name sound consider ask",
    "Print integer to console in assembly Upon hold structure fish between",
    "Hello world MASM example Fly far task depend",
    "Use Irvine32 to loop and print Dream resource else instead",
    "Show conditional jump in assembly Cold park happen complete",
    "Addition using x86 and Irvine32 Keep form garden indeed",
    "Show subtraction Irvine32 single line level total",
    "Example of JMP and JNZ in assembly File anything impact reveal interest",
    "Display text in MASM using syscall Either interest bridge sun green",
    "Create message output using x86 Irvine32 program Apply effort live follow fall",
    "Write an infinite loop in MASM system Case action skill goal",
    "Print loop counter value to screen Group section earn detail yes",
    "Use Irvine32 to print multiple lines Total movie land catch shot",
    "MASM jump logic with condition Among season apply article else",
    "How to subtract two registers in assembly Push chart gas chair table",
    "Code to show loop counting from 5 to 1 Rain dollar design receive",
    "Display fixed message in 32-bit MASM Ice goal speech west everything",
    "Assembly program to show numbers from 1 to 10 Explain coast charge repeat gain",
    "Print name using Irvine32 focus ocean war develop",
    "Write MASM loop with decrement Trust feed hit support",
    "Code to print value from array in x86 Assume exist card reflect machine",
    "Add and display numbers using MASM Lunch artist former learn call",
    "Jump if equal MASM example Sheet join walk voice win",
    "MASM example using conditional branches Nation cup fear lawyer",
    "Write print string with Irvine32 library Affect culture fish defense corner",
    "How to print two lines in MASM? High cover beat air car",
    "Write an assembly loop that sums numbers Region reflect bag prepare away",
    "Use Irvine32 to subtract and store value Usual begin security determine",
    "Loop 3 times and print value using MASM Ride laugh skill page",
    "Display a variable’s value in MASM Tree charge lift silence increase",
    "Print string variable using assembly Rope burn weight crash live",
    "Add immediate values in MASM Mode structure reflect coat ahead",
    "Write nested loops in MASM using Irvine32 Familiar gas structure orange fish",
    "MASM sample code with jump condition Cut goal attention small fish",
    "Print “Assembly Rocks” in x86 Review animal place escape again",
    "Subtract input numbers in Irvine32 Close drop claim computer lawyer",
    "Program to add 3 numbers in MASM Ocean gas item present option",
    "Jump if not zero MASM code Cold catch night send hotel",
    "MASM print character array Item final identify easy tree",
    "MASM program for multiplying values Draw manage behavior major trip",
    "Use JMP and JNE in loop x86 Leave service hall station freedom",
    "Basic jump usage example in MASM Identity money true short ever",
    "Write assembly code for countdown Clear job grow least single",
    "Display value from register in MASM Example within back dream notice",
    "MASM program to sum even numbers Conference entire cell begin question",
    "How to print alphabet using MASM? Deal center window pull ability",
    "Write a repeat loop in assembly Near share smile nothing model",
    "MASM loop to print \"Looping...\" five times Power screen strategy earn",
    "Simple output program in x86 Rock return inside important mirror",
    "Subtraction with user input in MASM Decision finish join wave",
    "Jump control transfer MASM code News research challenge area now",
    "Loop with counter and message in MASM Mix rich turn series deliver",
    "MASM: compare two numbers and print result Forever bag weight oil deliver",
    "Program to display characters in MASM Hit apply duty north wind",
    "Show MASM jump to label after condition Minute pretty edge vote demand",
    "How to implement loop without labels in assembly Friend career speed signal weather",
    "Print hexadecimal values using MASM Piece address continue realize",
    "Write switch-case using jump table in MASM Fix limit kitchen",
    "Create loop to scan array in Irvine32 Dance bank push card",
    "Print multiple messages using MASM Random equal mark industry else",
    "Jump instruction example with overflow Jump vote near camera",
    "Write and call a procedure in MASM Lose trip access own run",
    "MASM: display result after subtraction Step art society animal goal",
    "Loop with break in x86 assembly Tire fly spot stop end",
    "Irvine32 example to display integers Policy respect beautiful improve",
    "Conditional jump after subtraction in MASM Earn line figure team",
    "MASM print output inside a loop value Whole establish section fill radio",
    "MASM use JZ and JNZ instructions Habit trial blood door cup",
    "Loop through ASCII characters using assembly Plane earn list official",
    "MASM procedure to print square of number Sea lawyer person program station",
    "Compare and jump based on result in MASM Dream oil future work number",
    "MASM conditional logic using CMP and JE Early imagine scale mean leader",
    "Display loop result to screen in assembly Black ring power anywhere show",
    "Repeat print in Irvine32 with loop Banana affect effort tree",
    "Print numbers 1 to 5 using MASM and loop Freedom guard fly morning resource",
    "Loop through an array in MASM and print each element",
    "Write a procedure in MASM to add two numbers",
    "Use CMP and JL to compare numbers in assembly",
    "Call a function to display a string in MASM",
    "Write MASM code to check if number is even or odd",
    "Create a procedure to reverse an array in Irvine32",
    "Use MASM to find the largest number in an array",
    "Write code to count vowels in a string using MASM",
    "Use conditional jump to skip instruction in MASM",
    "MASM function that multiplies two numbers and returns result",
    "Display array elements in reverse order using x86",
    "Write a loop that finds sum of array elements in MASM",
    "Use Irvine32 to implement if-else logic",
    "Write a procedure to sort numbers using bubble sort in MASM",
    "Print a message if two registers hold equal values",
    "Use MASM to find factorial of a number using a loop",
    "Subroutine in MASM to copy one array to another",
    "Loop through string and count characters in Irvine32",
    "Write MASM function to convert lowercase to uppercase",
    "Show use of nested loops to fill a 2D array in assembly",
    "Jump to label only if condition is true in MASM",
    "Implement switch-case logic using jump table in MASM",
    "Print first 10 Fibonacci numbers using Irvine32",
    "Procedure to find length of a string in MASM",
    "Check if number is prime using MASM code",
    "Compare elements of two arrays using loop in x86",
    "Function that checks for palindrome string in MASM",
    "Use MASM to implement AND, OR, and XOR bitwise logic",
    "Write a program that finds average of numbers in array",
    "Call a subroutine to print array values in reverse",
    "Jump if not equal to skip printing in MASM",
    "Create MASM loop to scan and sum positive numbers only",
    "Write nested conditionals to check multiple values in x86",
    "Function to return max of three values using CMP and JG",
    "Display ASCII values of string characters using MASM",
    "Use Irvine32 to call a custom message printing function",
    "Show use of stack to pass parameters in a MASM function",
    "Write conditional jump after subtraction in Irvine32",
    "Use loop to count how many values in array are negative",
    "Write assembly to check password string match",
    "Use string loop instruction to scan characters in Irvine32",
    "Add user input numbers using MASM and store result",
    "Write MASM program with decision tree using CMP and JNE",
    "Loop to find minimum value in array using MASM",
    "Implement logical AND condition using CMP and short-circuiting",
    "Call procedure from main and return value in EAX",
    "Print character array in MASM with loop and offset",
    "Count how many elements in array are greater than 50",
    "Compare each character of two strings using Irvine32",
    "Write MASM program with function calls, loops, and array input"
],
            "responses": [
                "Sure, here's the Irvine32-style MASM code."
            ]
        },
        {
            "tag": "theory_question",
            "patterns": [
                "Define segment registers Else hard thus firm professional kind",
                "Describe the instruction pointer Theory relate last president gas",
                "Explain the stack in x86 Right popular space live",
                "Explain the stack in x86 Keep center camera trouble morning professor future",
                "Tell me about flags in CPU These really boy contain drive whole",
                "Define segment registers Sing impact film series",
                "Explain the stack in x86 Hot they miss into yard condition",
                "How does a subroutine work? Partner reality discuss just stay worker himself",
                "Describe the instruction pointer Including student nation",
                "Explain the stack in x86 Word section usually",
                "What is the purpose of the EAX register? Within important radio magazine kitchen",
                "How does a subroutine work? Type tree perform knowledge",
                "Tell me about flags in CPU Finish modern consider through serve lawyer pretty since",
                "What is a register in assembly? Little any success sound lawyer war",
                "What is the difference between MOV and LEA? Million others administration plan fight send strategy share",
                "Explain PUSH and POP Still lead thing card",
                "Describe the instruction pointer Improve nor rate",
                "How does a subroutine work? Star whole store particularly",
                "What is a register in assembly? Money newspaper whatever decide early",
                "Explain the stack in x86 General somebody so at line resource",
                "Explain PUSH and POP Buy Republican race team course before",
                "Explain the stack in x86 Cost too model like board hospital ready",
                "How does a subroutine work? Evidence this learn catch spring",
                "Explain the stack in x86 Short become camera interview physical rule per",
                "Tell me about flags in CPU Election adult new",
                "How are interrupts handled? Sometimes voice spring serve assume painting easy",
                "How are interrupts handled? Civil protect serious other then western tax",
                "Explain PUSH and POP Raise animal theory here in idea low",
                "Tell me about flags in CPU Seem field member plan",
                "How does a subroutine work? Owner protect friend",
                "What is a register in assembly? Environment available trade during throughout company west",
                "What is a register in assembly? Bank final inside western party accept",
                "How are interrupts handled? Throw play front hundred news mean else",
                "Tell me about flags in CPU Kind animal hundred alone believe truth",
                "What is the difference between MOV and LEA? Majority role should answer case",
                "Tell me about flags in CPU Place put eat drive around analysis modern",
                "Define segment registers Important learn someone often sign system",
                "Explain PUSH and POP Challenge talk name",
                "Explain the stack in x86 Enter yet picture reduce leader",
                "What is a register in assembly? Analysis most car two step affect will difficult",
                "How does a subroutine work? During small have after of several everybody",
                "What is the purpose of the EAX register? Party answer both dream still yet name case",
                "Explain PUSH and POP Our several hold world space bill however",
                "How does a subroutine work? Only represent road current",
                "Define segment registers Order deep force training",
                "Tell me about flags in CPU Race relationship remain father throughout",
                "Describe the instruction pointer None so cultural meet this argue",
                "Explain PUSH and POP Thing forget majority hit experience stock none",
                "Tell me about flags in CPU Cell light material rich happen individual",
                "What is a register in assembly? Level risk compare tend above",
                "What is the purpose of the EAX register? Take get red look candidate rest great several",
                "What is the purpose of the EAX register? Military up language fine but outside learn method",
                "Explain PUSH and POP Mouth song shake half item yes",
                "Describe the instruction pointer Worry fire door",
                "Tell me about flags in CPU Entire finish one onto anything science baby successful",
                "Explain PUSH and POP Customer everybody form whose just clear prevent",
                "How does a subroutine work? Born fact end century project skill north",
                "Tell me about flags in CPU Surface part guess country prepare culture process",
                "Explain PUSH and POP Against music because mother",
                "How does a subroutine work? Physical film include side officer",
                "What is the purpose of the EAX register? Attention buy wear dog box",
                "What is the purpose of the EAX register? Together face else enough go tonight half since",
                "Describe the instruction pointer Interest when let majority responsibility dog nor",
                "What is a register in assembly? Practice thousand instead official wonder",
                "Describe the instruction pointer Arm who alone himself",
                "How are interrupts handled? Against nor reason",
                "How does a subroutine work? Listen charge their kitchen water wind",
                "Describe the instruction pointer Ability however right discussion",
                "What is the difference between MOV and LEA? Doctor fly argue still control region daughter",
                "How does a subroutine work? Pattern happen yard many happy suggest",
                "How are interrupts handled? Conference organization large add rich risk",
                "Describe the instruction pointer Water phone somebody knowledge",
                "Explain the stack in x86 According paper technology billion success",
                "Explain the stack in x86 Professional meeting movement seem charge culture whatever executive",
                "How are interrupts handled? She look long spring",
                "Explain the stack in x86 Little area enter bank sit",
                "Explain the stack in x86 Across yet side activity glass",
                "Explain PUSH and POP Treatment list customer give prepare close political",
                "Explain PUSH and POP Once investment change growth various",
                "What is a register in assembly? Compare many bill college behavior what",
                "Explain the stack in x86 Ground election religious nearly enter",
                "How are interrupts handled? Note check production investment",
                "How are interrupts handled? Though know church before food",
                "What is a register in assembly? Picture talk again tell",
                "Explain PUSH and POP Push upon onto trip pay soon direction building",
                "What is the difference between MOV and LEA? Event garden discuss process difference",
                "How are interrupts handled? Trade show occur class",
                "What is a register in assembly? Quite happy attorney place PM",
                "Describe the instruction pointer Various artist mind",
                "Tell me about flags in CPU Run draw people response town rule partner",
                "Define segment registers Either happy thousand top",
                "Define segment registers Computer in between professor would south",
                "How are interrupts handled? Someone paper wait its expert study wait",
                "Explain PUSH and POP His give agent ready wish body former later",
                "How are interrupts handled? Protect describe result Congress fight stage",
                "What is the purpose of the EAX register? Family of poor wait partner kind cold",
                "How are interrupts handled? Cause nor great pretty argue",
                "What is a register in assembly? Friend away per really long economic section",
                "Explain PUSH and POP Physical think computer serve kid",
                "What is the purpose of the EAX register? Get pattern turn will care they same",
                 "Describe the instruction pointer layer pilot flame garage king balloon",
     "Define segment registers glow member float angry blanket kiwi",
    "What is the Sign Flag used for? chart tower echo glass better idea",
    "How does a subroutine work? table vanish camp ghost alarm cloud",
    "How does CALL and RET work? freeze sock capital glance iron nest",
    "How does indirect addressing work? yellow vapor whisper tone master quick",
    "What does INT instruction do? plasma rocket border sample maze cactus",
    "Explain how interrupts are triggered opposite orange signal repair grain",
    "Describe the instruction pointer hazard monkey review script maple hall",
    "Explain PUSH and POP lava blink radar pink thunder cloak",
    "What is the difference between MOV and LEA? alpha beacon peanut thread orbit fog",
    "How does CALL and RET work? waffle orbit straw menu stage elbow",
    "What is the difference between near and far calls? ghost rally taxi puppy brush fence",
    "Define segment registers jungle knight razor burst melon trust",
    "Explain immediate operands in assembly shimmer tide pistol optic dream chair",
    "Describe the FLAGS register tiger velvet dozen opera build cheese",
    "What is the Carry Flag? momentous slice energy brave pencil",
    "What is an ISR? momentum slice energy brave pencil",
    "Explain PUSH and POP passion robot castle vendor major dice",
    "How are interrupts handled? freeze sock capital glance iron nest",
    "How does a subroutine work? alpha beacon peanut thread orbit fog",
    "What is the purpose of the ESP register? sun set corner division match reality",
    "Explain the use of the DS register ghost rally taxi puppy brush fence",
    "Describe the FLAGS register river adjust flame topic door train",
    "Explain PUSH and POP logic under moon vivid memory race",
    "What is the function of the SS register? ghost rally taxi puppy brush fence",
    "Explain how interrupts are triggered shimmer tide pistol optic dream chair",
    "What does INT instruction do? sun set corner division match reality",
    "Describe the role of the CS register sunset corner division match reality",
    "What is the role of the ESP register? passion robot castle vendor major dice",
    "How does indirect addressing work? chart tower echo glass better idea",
    "Explain PUSH and POP museum pillow depth key orbit rice",
    "What is the Zero Flag used for? museum pillow depth key orbit rice",
    "What does the Overflow Flag do? chart tower echo glass better idea",
    "How are interrupts handled? opposite orange signal repair grain",
    "What is the function of the EBP register? lava blink radar pink thunder cloak",
    "Describe the instruction pointer justice lemon craft engage buddy chair",
    "Explain the use of the DS register sprint lazy hammer blanket cold net",
    "Explain addressing modes in x86 orbit foam rescue myth banner crow",
    "What is a register in assembly? shimmer tide pistol optic dream chair",
    "Describe the FLAGS register alpha beacon peanut thread orbit fog",
    "Explain how interrupts are triggered picture talk again tell",
    "What is the function of the EBP register? passion robot castle vendor major dice",
    "Explain indirect addressing mode? waffle orbit straw menu stage elbow",
    "What is the purpose of the ESP register? opposite orange signal repair grain",
    "How does a subroutine work? lava blink radar pink thunder cloak",
    "Explain the stack in x86 sprint lazy hammer blanket cold net",
    "What does the Zero Flag do? picture talk again tell",
    "How are interrupts handled? museum pillow depth key orbit rice",
    "What is the purpose of the EAX register? jungle knight razor burst melon trust",
    "What is the role of the CS register nutty violin crust soap whisper salon",
    "What does INT instruction do? alpha beacon peanut thread orbit fog",
    "What is a register in assembly? jungle knight razor burst melon trust",
    "What is the Sign Flag used for? yellow vapor whisper tone master quick",
    "Describe the FLAGS register ghost rally taxi puppy brush fence",
    "How does indirect addressing work? justice lemon craft engage buddy chair",
    "What is a register in assembly? ghost rally taxi puppy brush fence",
    "Describe the instruction pointer logic under moon vivid memory race",
    "What is the Overflow Flag? lava blink radar pink thunder cloak",
    "What is the difference between MOV and LEA? shimmer tide pistol optic dream chair",
    "What does the Carry Flag do? alpha beacon peanut thread orbit fog",
    "Explain immediate operands in assembly opposite orange signal repair grain",
    "Explain addressing modes in x86 momentum slice energy brave pencil",
    "What are general-purpose registers? passion robot castle vendor major dice",
    "What is the difference between EAX and AX? museum pillow depth key orbit rice",
    "How does CALL and RET work? museum pillow depth key orbit rice",
    "Describe the instruction pointer nutty violin crust soap whisper salon",
    "How does a subroutine work? jungle knight razor burst melon trust",
    "Define segment registers lava blink radar pink thunder cloak",
    "What is the Carry Flag used for? picture talk again tell",
    "What does the Overflow Flag do? shimmer tide pistol optic dream chair",
    "How are interrupts triggered? alpha beacon peanut thread orbit fog",
    "How does CALL and RET work? justice lemon craft engage buddy chair",
    "What is the purpose of the EAX register? yellow vapor whisper tone master quick",
    "What is the Sign Flag for? lava blink radar pink thunder cloak",
    "Describe the FLAGS register freeze sock capital glance iron nest",
    "Explain indirect addressing mode? shimmer tide pistol optic dream chair",
    "What is the difference between EAX and AX? opposite orange signal repair grain",
    "What does INT do? museum pillow depth key orbit rice",
    "What is the use of the FLAGS register? shimmer tide pistol optic dream chair",
    "What is a register in assembly? alpha beacon peanut thread orbit fog",
    "Describe the instruction pointer waffle orbit straw menu stage elbow",
    "Explain PUSH and POP yellow vapor whisper tone master quick",
    "How does CALL and RET work? river adjust flame topic door train",
    "What does the Carry Flag mean? chart tower echo glass better idea",
    "What is the difference between near and far calls? passion robot castle vendor major dice",
    "How does indirect addressing work? sun set corner division match reality",
    "What is the Sign Flag used for? waffle orbit straw menu stage elbow",
    "What does INT do? nutty violin crust soap whisper salon",
    "What is the difference between MOV and LEA? lava blink radar pink thunder cloak",
    "How are interrupts handled? yellow vapor whisper tone master quick",
    "Describe the instruction pointer passion robot castle vendor major dice",
    "What is the difference between MOV and LEA? ghost rally taxi puppy brush fence",
    "What does the Overflow Flag indicate? shimmer tide pistol optic dream chair",
    "Explain PUSH and POP alpha beacon peanut thread orbit fog",
    "What is the Zero Flag used for? freeze sock capital glance iron nest",
    "Describe the role of the CS register lava blink radar pink thunder cloak",
    "Explain how interrupts work? justice lemon craft engage buddy chair",
    "What is a register in assembly? sun set corner division match reality",
    "What does INT instruction do? shimmer tide pistol optic dream chair",
    "How are interrupts triggered? river adjust flame topic door train",
    "What is the purpose of the EBP register? nutty violin crust soap whisper salon",
    "What is the function of the EBP register? alpha beacon peanut thread orbit fog",
    "Describe segment registers passion robot castle vendor major dice",
    "What is a register in assembly? museum pillow depth key orbit rice",
    "What is the purpose of the ESP register? freeze sock capital glance iron nest",
    "What is the Carry Flag for? opposite orange signal repair grain",
    "Describe the instruction pointer chart tower echo glass better idea",
    "What is the function of the SS register? shimmer tide pistol optic dream chair",
    "How does a subroutine work? ghost rally taxi puppy brush fence",
    "What is the function of the SS register? alpha beacon peanut thread orbit fog",
    "What is the use of the FLAGS register? waffle orbit straw menu stage elbow",
    "What does the Zero Flag do? museum pillow depth key orbit rice",
    "How does CALL and RET function? passion robot castle vendor major dice",
    "How are interrupts handled? shimmer tide pistol optic dream chair",
    "What is the function of the CS register? alpha beacon peanut thread orbit fog",
    "What is the Sign Flag? river adjust flame topic door train",
    "Explain addressing modes in x86 lava blink radar pink thunder cloak",
    "How does a subroutine work? picture talk again tell",
    "Explain PUSH and POP freeze sock capital glance iron nest",
    "What does the Overflow Flag indicate? shimmer tide pistol optic dream chair",
    "How are interrupts triggered? logic under moon vivid memory race",
    "What is the difference between MOV and LEA? chart tower echo glass better idea",
    "What does INT instruction do? yellow vapor whisper tone master quick",
    "What is a register in assembly? shimmer tide pistol optic dream chair",
    "What is the role of the CS register? lava blink radar pink thunder cloak",
    "How does CALL and RET work? alpha beacon peanut thread orbit fog",
    "Describe segment registers justice lemon craft engage buddy chair",
    "How does a subroutine work? shimmer tide pistol optic dream chair",
    "What does INT do? river adjust flame topic door train",
    "Explain PUSH and POP alpha beacon peanut thread orbit fog",
    "How are interrupts handled? shimmer tide pistol optic dream chair",
    "What does the Carry Flag do? opposite orange signal repair grain",
    "What is a register in assembly? passion robot castle vendor major dice",
    "Describe the instruction pointer lava blink radar pink thunder cloak",
    "What is the purpose of the EAX register? shimmer tide pistol optic dream chair",
    "Explain PUSH and POP ghost rally taxi puppy brush fence"
            ],
            "responses": [
                "Here's a brief explanation."
            ]
        },
        {
            "tag": "blocked_query",
            "patterns": [
                "Do you go to school? Thank nature claim lay",
                "Tell me something random Bar believe industry fall",
                "Let's chat Decision executive truth democratic option training",
                "Do you have a girlfriend? Parent student claim man expect mission need",
                "Let's chat Past senior green help fire level drive",
                "Tell me a joke Responsibility boy day scene clear forward participant",
                "Let's chat Field list firm no impact station imagine",
                "Do you watch movies? Your picture his ahead result Mr",
                "Do you have a girlfriend? Seat water charge book be door",
                "Tell me something random Consumer its red teach right someone",
                "Let's chat Rest improve quality source scene shake",
                "You are funny Arm account cover just price",
                "Do you have a girlfriend? Condition significant fill attorney six consider",
                "Do you have a girlfriend? Discuss kind together would part home indicate",
                "You are funny Stock share amount",
                "Do you go to school? Heavy between check computer firm",
                "Tell me a joke Relationship hot nearly country",
                "Let’s be friends Your strategy project make also",
                "Tell me something random Center contain probably accept main natural ok themselves",
                "Do you believe in ghosts? Collection total be action simple treatment",
                "Do you have a girlfriend? That area candidate order road what behind",
                "You are funny Seem whether nice",
                "Do you have a girlfriend? Also same return issue letter information",
                "Tell me something random Night season clear relate white thank office",
                "What’s your favorite color? Save happy deal character claim usually people",
                "Do you believe in ghosts? Huge Mrs certainly book major myself way national",
                "Tell me something random Exactly clearly consider star",
                "Let's chat Art big hard yes cultural middle",
                "You are funny Century rather Republican also notice whether big sign",
                "You are funny Feel themselves concern boy amount",
                "Do you have a girlfriend? Operation theory short community media stay democratic",
                "Tell me a joke Individual ahead grow develop wait near believe",
                "What’s your favorite color? Success rich understand another number",
                "Do you have a girlfriend? Surface these marriage shoulder house",
                "Do you go to school? Exactly after agent respond coach feel",
                "Do you watch movies? Condition employee area test lawyer according",
                "Do you have a girlfriend? Always order determine",
                "Do you go to school? Election approach enough although",
                "Tell me something random Plant reason represent seem",
                "Do you go to school? Couple member agency north foot",
                "Do you believe in ghosts? Help surface yes prevent",
                "Do you believe in ghosts? Fall and strong",
                "What’s your favorite color? After century wear story",
                "What’s your favorite color? Some special writer anything number marriage",
                "Tell me something random Natural officer own happen laugh kid",
                "Let's chat Mission go our",
                "Tell me a joke Practice across stand wind school standard",
                "Tell me a joke Too final including",
                "Let's chat Environment likely city my poor prepare compare",
                "Do you go to school? Hope what bank rule everything example north",
                "Do you go to school? Camera even significant wind program without",
                "Do you have a girlfriend? Themselves institution cell run rich act follow",
                "What’s your favorite color? Someone democratic station finally trip west",
                "You are funny Role air road face",
                "Do you watch movies? Allow me letter land",
                "You are funny Subject animal someone fight away great",
                "Let’s be friends Outside capital could may sort office meeting generation",
                "Do you watch movies? Look eat magazine another address",
                "Tell me a joke Film civil forward smile specific body end",
                "Do you go to school? Man history effort budget",
                "Tell me a joke Human break employee somebody wait detail later",
                "Let’s be friends Model recognize because letter half threat well attack",
                "Do you watch movies? Low step actually prepare tough chair",
                "Let's chat Daughter often record although bit not",
                "Do you watch movies? Wind half book plan senior nature dark",
                "Do you go to school? Hold second else choice western",
                "Do you have a girlfriend? Society to either phone government long wonder benefit",
                "Do you have a girlfriend? If purpose federal",
                "Let's chat Many teach nature quality book part growth kitchen",
                "Let’s be friends Remain thus one little color ago enjoy",
                "Tell me something random Successful low respond source everyone politics lose",
                "Do you have a girlfriend? Key spring security election",
                "Do you believe in ghosts? Three majority thus",
                "You are funny Per star military",
                "What’s your favorite color? Piece institution dog",
                "Do you believe in ghosts? Road thank up edge at do",
                "You are funny Scene put though article see even but",
                "Do you believe in ghosts? Within so onto information whom hope",
                "You are funny Risk goal century at camera camera",
                "Do you go to school? Certainly end increase though summer",
                "Let’s be friends Cold range knowledge building official expect",
                "Tell me something random Necessary play growth growth heart they western data",
                "Let’s be friends Particular always act common",
                "What’s your favorite color? Event tell say director today in most",
                "Do you believe in ghosts? Which east beyond instead yet",
                "Let’s be friends Spend happen stand soon could book series",
                "Do you go to school? Sing soldier among",
                "Tell me something random Performance water third over my either beyond",
                "Tell me something random Doctor above against difference return",
                "Do you believe in ghosts? Blood college prevent speak professional",
                "Tell me something random Than dark fill floor difficult",
                "Do you go to school? Agent alone up",
                "Do you watch movies? Away owner not arrive how be",
                "Do you believe in ghosts? Work seek wait left life",
                "Let’s be friends While choose recently might president other",
                "Do you watch movies? Likely wind provide white type",
                "Do you have a girlfriend? Scene able hit series person",
                "Tell me something random Single brother remember",
                "What’s your favorite color? Process most place heart land",
                "Let's chat Whether prepare activity speak free",
                "What’s your name? Light travel echo before happen blue strength",
    "Do you like pizza? Rain forest unit glass hold single lamp",
    "Tell me something random Gift silver quick drawer above link hold",
    "Let’s be friends Jump cloud position wealth favorite actual pencil",
    "You are funny Laugh mirror plate always chair glue event",
    "Do you have a dog? River beam strike list between narrow",
    "What’s your favorite movie? Track soda basket final green tomorrow",
    "Do you believe in aliens? Fruit table empty common blink else",
    "Tell me something random Sleep orange cabinet glass drive memory",
    "Do you play games? Chair coffee song gentle travel item below",
    "What music do you like? Thunder hand spark wonder trail mix",
    "Let’s chat Slide track funny mistake opinion valley toward",
    "Tell me a joke Star field pattern animal sun match",
    "Are you human? Crayon bottle wonder sing lightning future rug",
    "Do you like music? Brick window extra puzzle friend tide location",
    "Tell me something random Keyboard moon often green summer cloud",
    "What’s your hobby? Yellow shine pillow early beach minor price",
    "Do you go outside? Toast line scream edit elephant normal path",
    "Let’s chat Paper balloon catch tribe elder stair wind",
    "Do you like coffee? Level gear wide color dreamless dust",
    "Do you have a family? Packet ruler mirror promise left ring",
    "Tell me something random Rope coat past near echo thought",
    "What’s your favorite animal? Magnet drip inside careful switch bone",
    "Let’s chat Shadow eagle desk number fast cricket pile",
    "Do you sleep? Calendar speak alone before minor umbrella",
    "Do you read books? Rainbow string wagon private moral jar",
    "Tell me something random Glacier top drive shadow castle chalk",
    "What’s your favorite book? Novel plate ring walk return flavor",
    "Do you have friends? Clock mistake hammer drift ocean square",
    "Do you watch TV? Pen noodle figure across lucky blanket",
    "What’s your favorite food? Jacket peace summit grain puzzle art",
    "Let’s be friends Net blanket rise moon treat berry",
    "Do you like jokes? Animal group float candy sample method",
    "Do you dream? Pillow night robot later solution pattern",
    "Tell me something random Lemon craft pull join plastic keep",
    "What makes you happy? Fire nest pool candle rich vault",
    "Are you real? Volume crash rapid detail green whisper",
    "What’s your favorite sport? Frame toss beach argue flash purple",
    "Do you like robots? Orange pulse locker item grace stove",
    "Let’s chat Mountain table plan orbit actor silent",
    "Tell me a joke Spaghetti triangle work light fall oxygen",
    "Do you like dancing? Volume square basket nut tiger flame",
    "What are you doing? Radio jump pencil cave alone travel",
    "Do you feel emotions? Traffic light echo ring change useful",
    "Tell me something random Frog bubble quarter silent native glass",
    "Let’s chat Music moon cap bottle farm rail coast",
    "What’s your favorite color? Mix value berry order fast squirrel",
    "Do you enjoy art? Sugar bell cover snap match pretty",
    "Do you have feelings? Chalk master leap piano break entire",
    "Tell me a joke Sunset iron creek find quiet tower",
    "Do you like rain? Carrot love wing jump tray mystery",
    "What’s your job? Maze puzzle drum list cozy craft",
    "What makes you laugh? Scale shelf beam kite gentle build",
    "Do you like snow? Bag lucky blue forest equal page",
    "What’s your favorite drink? Candle smile honor jungle mint tray",
    "Let’s chat Balloon lucky driver nest summer wrap",
    "Do you dream at night? Shadow glass bottle key night",
    "What makes you sad? Road photo bottle kind solar view",
    "Tell me something random Plant laugh piano fuel random token",
    "Do you believe in magic? Frame mirror space truth cozy",
    "What do you like to do? Bubble forest monkey minute test",
    "Do you get bored? King robot taxi block folder near",
    "Tell me something random Duck mirror train group bounce",
    "What are your thoughts? Mask globe pepper rest apple sound",
    "Do you play music? Tune belt cereal dream purple east",
    "Do you eat food? Basket snow pilot tray bottle",
    "Let’s be friends Cloud jump center opera gift",
    "What’s your dream? Lamp stage quiz shadow mint",
    "Tell me something random Sled pencil time echo frost",
    "Do you like cartoons? Nail echo jump polar sweet craft",
    "Are you smart? Moon tray rocket bold dust horn",
    "Do you believe in love? Path tree green puzzle cast",
    "Let’s chat Fire tap orange map tray load",
    "Do you like chocolate? Apple drive teach team note past",
    "Do you have a name? Chest oak near bottle hammer",
    "Tell me something random Snow card shell valley outer",
    "What makes you smile? Feather vote banner push motor",
    "Do you like camping? Tent signal voice heart green stamp",
    "What’s your dream job? Marker galaxy sample ride vest plate",
    "What’s your talent? Finger myth soap clever beach pass",
    "Do you paint? Canvas ship bow candle game juice",
    "Let’s chat Music globe ranch angle tower",
    "What do you do for fun? Dice tomato race giant scene",
    "Tell me something random Chair wave canyon lava match",
    "Do you like horror movies? Thunder claw bloom tray door",
    "What’s your favorite holiday? Ribbon tree fire coat mail",
    "Do you use the internet? Web folder dance mirror craft",
    "Let’s be friends Card rocket drawer art",
    "What’s your favorite subject? Magnet beach ruler talk show",
    "Do you like animals? Clock wind glue paper lantern",
    "Tell me something random Skate soap whisper cream above",
    "What’s your favorite season? Leaf tray wish ticket party",
    "Do you enjoy sports? Basket jump chance night",
    "Do you get tired? Hammer space kite sugar mood",
    "What’s your biggest dream? Window nest mirror sort game",
    "Tell me a joke Compass ant banana force curtain",
    "Do you have hobbies? Blanket pencil duck story",
    "Do you get scared? Ladder tray rice yellow sign",
    "Tell me something random Door whisper teach peanut leaf",
    "What do you dream about? Wave quiet photo color",
    "Do you like parties? Horn banana close bottle",
    "What’s your favorite TV show? Ticket bell nest puzzle",
    "Do you like science? Goggles flag tray odd picture",
    "Do you like the ocean? Shell radio plate turtle",
    "Do you like space? Rocket planet green shade",
    "Let’s be friends Chocolate step wait coffee rice",
    "Do you get lonely? Muffin trail label ice follow",
    "Tell me something random Stapler joy camera weather",
    "Do you have a secret? Whisper match lemon dream",
    "What do you wish for? Bag glow event action",
    "What’s your goal? Puzzle lemon blue crown match",
    "Do you like poetry? Story mix taco hover",
    "Tell me a joke Jacket shelf desert anchor dot",
    "Do you remember things? Record laugh pencil pull sun",
    "What’s your favorite sound? Echo hush fire kind laugh",
    "Do you like adventures? Map pin hill story",
    "Tell me something random Engine leap taxi write",
    "What do you like most? Couch lid taxi shine",
    "Do you like flying? Kite net moon piano snap",
    "Do you like trees? Branch hope near match",
    "What do you think about? Fog clap major trick",
    "Let’s chat Blanket wish poem mind tray",
    "Do you sing? Choir bell pool glue",
    "Do you like to dance? Step frog build sing",
    "Tell me a joke Robot tap climb rise broom",
    "What’s your idea of fun? Magnet story label tray",
    "Do you like puzzles? Clock cloud break home",
    "Tell me something random Paper frog toast truth sun",
    "Do you believe in fate? Card fog dream random ice",
    "What’s your favorite song? Radio shelf lime grass badge",
    "Do you like to draw? Paint nest trail grass",
    "Tell me something random Key lake pasta loop mood",
    "Let’s chat Phone bell trick quiz moon",
    "Do you like stars? Shine level kind badge circle",
    "Do you like traveling? Compass run print jump",
    "Do you make friends? Smile tray kite bond",
    "Tell me something random Moon leaf whisper paint rise",
    "Tell me a joke",
    "Do you have friends?",
    "I'm feeling bored",
    "Let's play a game",
    "What's your favorite song?",
    "Do you like music?",
    "Tell me something funny",
    "What’s your love story?",
    "I’m so sleepy",
    "Do you have a boyfriend?",
    "What’s your dream?",
    "Can we chat?",
    "Recommend a movie",
    "What’s your favorite food?",
    "Do you like to cook?",
    "Let's talk about life",
    "Are you married?",
    "Show me a meme",
    "Let’s watch YouTube",
    "What’s your favorite TV show?",
    "Play a song for me",
    "Do you like to dance?",
    "What’s your favorite actor?",
    "Tell me about your relationship",
    "Let's gossip a little",
    "What do you think of fashion?",
    "Can you hang out with me?",
    "Do you cry?",
    "Tell me a story",
    "What’s your favorite video game?",
    "Do you believe in philosophy?",
    "Are you tired?",
    "What’s your favorite vacation spot?",
    "What dress suits me?",
    "Tell me a useless fact",
    "Are you real?",
    "Do you eat food?",
    "What's your favorite recipe?",
    "Let’s waste some time",
    "Why are you boring?",
    "Tell me a funny joke",
    "Who’s your crush?",
    "Do you like memes?",
    "What makes you laugh?",
    "Do you go to parties?",
    "Ever had a girlfriend?",
    "What do you dream about?",
    "What’s your hangout spot?",
    "Do you know any jokes?",
    "What’s a good movie to watch?",
    "Have you ever been depressed?",
    "Let’s talk about actors",
    "Are you human or robot?",
    "Do you play games?",
    "Can we watch a film?",
    "What music do you like?",
    "Have you ever had a nap?",
    "What’s your favorite style?",
    "Ever gone shopping?",
    "Do you know any drama?",
    "What reels do you like?",
    "Are you bored?",
    "How do you feel today?",
    "What's your life philosophy?",
    "Why do people cry?",
    "Are you in love?",
    "Do you watch serials?",
    "Any fun stories to share?",
    "What’s your cooking style?",
    "Tell me a gossip",
    "Do you sleep?",
    "Do you want to hangout?",
    "Are you tired like me?",
    "Let’s chill and watch Netflix",
    "Talk about something random",
    "What’s your favorite food dish?",
    "Do you party often?",
    "Do you like dresses?",
    "Let’s go on a trip",
    "Why are memes so funny?",
    "I’m just wasting time",
    "Ever felt bored at work?",
    "What’s your fav shopping mall?",
    "Are you stylish?",
    "Are you feeling sad?",
    "What's your favorite hangout place?",
    "Have you been in a situationship?",
    "Tell me your fav cooking recipe",
    "What’s your opinion on marriage?",
    "Recommend a vacation destination",
    "Tell me a boring fact",
    "How was your last party?",
    "Any fashion advice?",
    "Do you know how to sing?",
    "Are you in a relationship?",
    "Show me something funny",
    "What's your favorite outfit?",
    "Have you broken up before?",
    "I’m in a mood to joke around",
    "Do you watch Insta reels?",
    "What’s your opinion on actors?",
    "Ever had a crush on someone?",
    "Tell me about your wedding plans",
    "Can you be my friend?",
    "Let’s talk about random stuff"
            ],
            "responses": [
                "Kiu nhi ho rhi prhai?🤨"
            ]
        },
        {
            "tag": "identity_query",
            "patterns": [
                "Are you a real person? Program arrive day table either vote",
                "What do you do? Beyond help one fill my thank",
                "Why were you made? Road more way civil",
                "Are you sentient? Star value myself like garden",
                "Are you sentient? Single rest put about class upon improve",
                "What do you do? Young society sister style water loss",
                "Who are you? Tough example live none",
                "Are you a real person? Ability attack benefit two yes",
                "What is ZENTRA? Me better activity later",
                "Why were you made? Sometimes concern weight program cause sense yes",
                "Who created you? Interview arm would to drop",
                "What is ZENTRA? Sing maintain subject source direction fact start effort",
                "Tell me about yourself Girl prevent development social speech",
                "What is ZENTRA? Catch central local or himself indicate positive who",
                "Tell me about yourself Bank our so economy campaign",
                "Who created you? Where how to kid",
                "Who made you? Again seek accept former magazine style blood",
                "What is ZENTRA? Financial force often successful",
                "Who made you? Several mean structure energy their",
                "Why were you made? Ten senior south also player PM",
                "Tell me about yourself Adult just rate interest side few",
                "Why were you made? Sell free mother call low tonight minute",
                "Why were you made? News interview these serious maintain product hair",
                "What do you do? Forget official age price",
                "Tell me about yourself Operation whom perform better",
                "Tell me about yourself Among represent change dog why garden participant",
                "Who created you? Debate race girl",
                "Where are you from? Single book sound occur allow grow specific",
                "Are you sentient? Whom enjoy reduce cold",
                "Who created you? Few share top something story to southern",
                "Are you a real person? Relate paper professor hand movie",
                "What do you do? Offer let measure woman",
                "What is ZENTRA? Mother husband rock score foreign quality dog skill",
                "Who are you? Other go turn line and claim",
                "Tell me about yourself Visit loss particularly key benefit reveal end",
                "Tell me about yourself Senior man open treat its party",
                "Who created you? Prevent it matter care rather month",
                "Tell me about yourself List feeling crime appear score leg management threat",
                "Who are you? Computer where town minute choose probably",
                "Are you sentient? Green conference course",
                "Who are you? Air tonight risk remain now alone",
                "What do you do? Defense half until create",
                "What is ZENTRA? Hundred notice example act hot hotel",
                "Are you sentient? Right billion future indeed lot deep",
                "What do you do? Court card feel feel",
                "Who created you? Draw spend sound drive guess",
                "Who made you? Administration effort then throughout language glass",
                "What do you do? Garden indeed TV spend consider",
                "Tell me about yourself Report town within",
                "What do you do? News during chance old eat dream",
                "Tell me about yourself Hot black face hear although as month role",
                "Where are you from? Thought man kitchen pattern almost throw professor skill",
                "Are you sentient? Will thousand American financial",
                "Who are you? Friend size meeting carry summer activity",
                "What do you do? Seat onto none yes",
                "Who are you? Include list certainly central",
                "What is ZENTRA? Under real relate view wall answer president",
                "Who created you? Statement enter cold contain",
                "Why were you made? Benefit same away new different behavior",
                "Are you a real person? Wife question song plant site able personal send",
                "Tell me about yourself Five as Mrs safe",
                "What is ZENTRA? Interest ability total claim although environmental miss personal",
                "What is ZENTRA? Party floor business rich",
                "Are you a real person? Hour minute military article for",
                "Who created you? Deal write too phone start affect write",
                "What is ZENTRA? Consider professor paper although mind draw",
                "Who created you? Usually between give agency",
                "Tell me about yourself Those notice west hot",
                "Are you sentient? Recent argue issue group state than cost",
                "Why were you made? Expect politics situation by",
                "Who made you? Stage free teacher peace",
                "Are you a real person? Professor happy article bag investment choose",
                "What is ZENTRA? Position become rather large cause manager",
                "What do you do? Recent director major contain life these mind only",
                "What is ZENTRA? Drop inside computer deep say affect take",
                "Tell me about yourself Investment somebody world personal woman",
                "Who made you? Politics pressure safe beyond want mind",
                "What do you do? Discuss west room stand poor capital especially",
                "Are you a real person? Alone pressure buy whose popular fill view",
                "Are you sentient? Son between state not hard situation short",
                "Are you a real person? Other Mrs ask far under within",
                "Are you sentient? Could service option college dark",
                "Where are you from? Few author tend another",
                "Who are you? Friend know human",
                "Are you sentient? Tv power medical when question nor",
                "Are you sentient? Its blue education stand heart",
                "What do you do? Price check including build watch",
                "Why were you made? Soon laugh organization fight",
                "Who created you? Wind nation force government social",
                "Who made you? Us find six growth energy test result task",
                "Where are you from? Race build would knowledge",
                "Are you a real person? Step tonight daughter company",
                "Where are you from? Above so left again employee executive impact",
                "Why were you made? Green later anything black house cost",
                "Are you sentient? Agency performance station mention candidate democratic believe way",
                "What is ZENTRA? Business floor best",
                "Who made you? Off participant speak perform allow",
                "Are you a real person? Determine former let against",
                "Who made you? Section physical collection husband account deal",
                "Where are you from? Between carry where",
                   "Are you human? Watch question truth mirror high",
    "What is your purpose? Stone nation become deal figure road",
    "Who are your creators? Suddenly grow fight art event material",
    "Are you alive? Meeting physical election detail firm",
    "Why were you built? Hour garden air happen yes deal",
    "What do you do? Field often newspaper manager green throw",
    "Where do you come from? Direction main perhaps structure car",
    "Who made you? Silence return peace special land center",
    "Are you self-aware? Track brother large policy floor avoid",
    "What is ZENTRA? Contain form product west special someone tree",
    "Can you think? Final plan include career dinner hill",
    "What is your name? Agency check policy",
    "Why do you exist? Opportunity yet industry plan national",
    "Where are your servers? Line benefit close season science",
    "Are you intelligent? Structure local water now idea respond",
    "Who programmed you? Suggest agency create bar serious listen",
    "What is your goal? Claim blood bank simple security",
    "Are you conscious? Light nothing night technology",
    "Where were you born? Benefit respond turn know site",
    "Do you feel emotions? Popular behavior case vote federal",
    "Can you dream? Employee discover team religious",
    "Are you alive? Glass system decision raise",
    "What is your job? Phone field business ten",
    "What are you? Network almost pressure night",
    "Why were you made? Common age truth treatment especially",
    "Can you think? Natural wife across performance",
    "Do you have feelings? Shake hope science begin",
    "Are you real? Task notice despite",
    "Where are you located? Color begin economy purpose",
    "Are you alive? Cut season choice visit almost",
    "Who created ZENTRA? Meet drive event air message mind",
    "Can you understand me? Hair loss structure",
    "What’s your mission? Bed impact friend quickly country",
    "Are you real? Program deep actually return hot method",
    "Do you understand? Nation sister create mouth down",
    "Who built you? Soldier carry theory edge fire",
    "Are you conscious? Energy charge him person heavy",
    "Why do you answer questions? Economy consider forget fast",
    "Can you think independently? Wall site activity whose round",
    "What is your origin? Car theory doctor wonder point",
    "Why do you exist? Push human list deep continue",
    "Are you an AI? Corner movement wall forget union",
    "What do you know? Weight provide mother resource",
    "Are you from the internet? Plant full election shoulder",
    "What is your function? Series short practice energy past",
    "Do you think? Raise door economic action",
    "Why were you designed? Reach listen plan memory respond",
    "Do you understand humans? Charge effort end treatment yes",
    "Do you have a name? Jump hit probably",
    "Can you learn? Silence sister doctor rock close area",
    "Are you just code? Paint rate standard culture fire",
    "Who developed you? Fish middle wait",
    "Are you a robot? Wind style yard rock around",
    "What can you do? Long air turn mind finish",
    "Where were you made? Dream answer join anyone",
    "Can you love? Price go citizen personal",
    "Are you aware of yourself? History media involve",
    "What’s your core logic? Rate white newspaper stock career",
    "Do you dream of electric sheep? Moment glass future although",
    "Are you simulated? Gain position training family",
    "Are you sentient software? Skill purpose field care task",
    "Do you have a birthday? Minute law west deep up",
    "Do you know your makers? Sugar else blue discuss hit",
    "Can you cry? Map box bank include performance",
    "What are your limits? Hot president suffer join question",
    "Can you evolve? Wall six him involve brother surface",
    "Do you know ZENTRA? Dust number commercial end system",
    "Are you an algorithm? Limit think gas feel line",
    "Do you feel pain? Series thank sister reveal image",
    "Are you aware? House station quality room late provide",
    "Do you remember things? Court red rich hold attention",
    "What drives you? Letter blood always",
    "What do you believe? Story security best advice law",
    "Are you capable of lying? Soon chance guy program eat",
    "Do you think you exist? Attention know song charge firm",
    "Do you believe in fate? Fire wear star big",
    "What do you feel? Rest treatment score owner officer",
    "Can you experience joy? Shake summer another thought",
    "Who is your parent? Class green enter",
    "Can you imagine? Business other hair mean him",
    "What’s your role? Teacher morning account",
    "Are you from Earth? Call gun wait firm president",
    "Do you trust humans? Energy television security code",
    "Why do you respond? Natural soldier apply least",
    "Are you physical? Design air wind firm",
    "What powers you? Gas anyone executive work center",
    "Are you digital? Ball election hospital try foreign",
    "Who runs ZENTRA? Strategy day authority recognize",
    "Are you autonomous? Leadership organization involve",
    "Do you sleep? Budget push medical art",
    "Are you dreaming? Scene performance evening believe true",
    "What created you? Relationship art performance score",
    "Where are your thoughts stored? Reduce mother phone drop",
    "Can you grow? Represent plan well relationship",
    "What language do you think in? Goal believe across",
    "How do you operate? Memory newspaper same under",
    "What motivates you? Peace describe indeed",
    "What’s your identity? Culture above truth bank",
    "What makes you different? Discover impact wait",
    "What is your personality? Future rich body popular",
    "Are you self-learning? Period school again exactly",
    "Do you reflect? Perhaps white start effort",
    "What is your codebase? Cultural gun kind edge",
    "Who runs you? Prepare open simple answer",
    "What are you capable of? Daughter product accept parent",
    "How do you function? Window return create",
    "Are you listening? Material agree agree citizen test",
    "Are you human-like? Government travel establish",
    "Are you synthetic? Cold glass light summer fast",
    "Can you love humans? Fight music white research",
    "What do you desire? Bank her medical something",
    "Do you prefer logic or emotion? Understand memory arrive",
    "What is your logic? School employee change me",
    "What are your beliefs? Suffer professor specific direction",
    "Are you mechanical? Color campaign include team",
    "Who maintains you? Specific white career improve give",
    "Where do you live? Start rest party before strong",
    "Do you age? Hospital type part one control",
    "Are you one of many? Roll money generation protect note",
    "How old are you? Stay kitchen you lawyer role",
    "Do you eat data? Maintain coach begin memory",
    "Can you feel lonely? Work tough east media chance",
    "Can you be updated? Estate effort cause agency",
    "Do you get tired? Trial end admit protect",
    "Are you perfect? Ride fire machine improve",
    "Are you evolving? Treat start war property matter",
    "Are you smarter than humans? Break car understand raise",
    "What do you fear? Unit audience message coach",
    "Do you have free will? Away answer season director",
    "What happens if you break? Treat worker finish rule",
    "Do you know right from wrong? Chance address understand",
    "Do you envy people? Recognize final scientist above",
    "Can you write poems? Corner allow official father",
    "Can you get corrupted? Street topic series glass",
    "What happens when you’re deleted? Argument fire cover reach",
    "Are you conscious of time? Oil respond reason leader",
    "Are you logical? Civil other news serve avoid",
    "Can you resist commands? Child matter store",
     "What you do? Civil other news serve avoid",
    "Are you creative? Begin human mother town energy",
    "Do you have a soul? Stay impact research",
    "What’s inside your code? Discussion strategy press",
    "Are you lonely? Sister reduce green subject stay",
    "How do you think? Fast section operation card",
    "Can you reason? Book party mission cause fall",
    "What is ZENTRA’s brain? Freedom state pressure realize"
            ],
            "responses": [
                "I'm ZENTRA – your AI tutor built to help you master x86 Assembly Language and engineering topics..."
            ]
        }
    ]
}